#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_elasticache_cluster.redis: Refreshing state... [id=redis-cluster10]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_elasticache_cluster.redis must be replaced
-/+ resource "aws_elasticache_cluster" "redis" {
      + apply_immediately          = (known after apply)
      ~ arn                        = "arn:aws:elasticache:us-east-2:213684739071:cluster:redis-cluster10" -> (known after apply)
      ~ availability_zone          = "us-east-2b" -> (known after apply)
      ~ az_mode                    = "single-az" -> (known after apply)
      ~ cache_nodes                = [
          - {
              - address           = "redis-cluster10.tzpp1z.0001.use2.cache.amazonaws.com"
              - availability_zone = "us-east-2b"
              - id                = "0001"
              - outpost_arn       = ""
              - port              = 6379
            },
        ] -> (known after apply)
      + cluster_address            = (known after apply)
      ~ cluster_id                 = "redis-cluster10" -> "redis-cluster11" # forces replacement
      + configuration_endpoint     = (known after apply)
      ~ engine_version_actual      = "7.0.7" -> (known after apply)
      ~ id                         = "redis-cluster10" -> (known after apply)
      ~ ip_discovery               = "ipv4" -> (known after apply)
      ~ maintenance_window         = "thu:00:00-thu:01:00" -> (known after apply)
      ~ network_type               = "ipv4" -> (known after apply)
      + preferred_outpost_arn      = (known after apply)
      + replication_group_id       = (known after apply)
      ~ security_group_ids         = [] -> (known after apply)
      ~ security_group_names       = [] -> (known after apply)
      - snapshot_retention_limit   = 0 -> null
      ~ snapshot_window            = "03:00-04:00" -> (known after apply)
      ~ subnet_group_name          = "default" -> (known after apply)
      - tags                       = {} -> null
      ~ tags_all                   = {} -> (known after apply)
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + redis_endpoint = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @aterhune1984, Action: `pull_request`*